GopalSaraf/Practicals/PSDL/include/proc/pic18lf24k22.inc
// Register: IOCB
#define IOCB IOCB
IOCB                                     equ 0F62h
// bitfield definitions
IOCB_IOCB4_POSN                          equ 0004h
IOCB_IOCB4_POSITION                      equ 0004h
IOCB_IOCB4_SIZE                          equ 0001h
IOCB_IOCB4_LENGTH                        equ 0001h
IOCB_IOCB4_MASK                          equ 0010h
IOCB_IOCB5_POSN                          equ 0005h
IOCB_IOCB5_POSITION                      equ 0005h
IOCB_IOCB5_SIZE                          equ 0001h
IOCB_IOCB5_LENGTH                        equ 0001h
IOCB_IOCB5_MASK                          equ 0020h
IOCB_IOCB6_POSN                          equ 0006h
IOCB_IOCB6_POSITION                      equ 0006h
IOCB_IOCB6_SIZE                          equ 0001h
IOCB_IOCB6_LENGTH                        equ 0001h
IOCB_IOCB6_MASK                          equ 0040h
IOCB_IOCB7_POSN                          equ 0007h
IOCB_IOCB7_POSITION                      equ 0007h
IOCB_IOCB7_SIZE                          equ 0001h
IOCB_IOCB7_LENGTH                        equ 0001h
IOCB_IOCB7_MASK                          equ 0080h

// Register: PSTR2CON
#define PSTR2CON PSTR2CON
PSTR2CON                                 equ 0F63h
// bitfield definitions
PSTR2CON_STR2A_POSN                      equ 0000h
PSTR2CON_STR2A_POSITION                  equ 0000h
PSTR2CON_STR2A_SIZE                      equ 0001h
PSTR2CON_STR2A_LENGTH                    equ 0001h
PSTR2CON_STR2A_MASK                      equ 0001h
PSTR2CON_STR2B_POSN                      equ 0001h
PSTR2CON_STR2B_POSITION                  equ 0001h
PSTR2CON_STR2B_SIZE                      equ 0001h
PSTR2CON_STR2B_LENGTH                    equ 0001h
PSTR2CON_STR2B_MASK                      equ 0002h
PSTR2CON_STR2C_POSN                      equ 0002h
PSTR2CON_STR2C_POSITION                  equ 0002h
PSTR2CON_STR2C_SIZE                      equ 0001h
PSTR2CON_STR2C_LENGTH                    equ 0001h
PSTR2CON_STR2C_MASK                      equ 0004h
PSTR2CON_STR2D_POSN                      equ 0003h
PSTR2CON_STR2D_POSITION                  equ 0003h
PSTR2CON_STR2D_SIZE                      equ 0001h
PSTR2CON_STR2D_LENGTH                    equ 0001h
PSTR2CON_STR2D_MASK                      equ 0008h
PSTR2CON_STR2SYNC_POSN                   equ 0004h
PSTR2CON_STR2SYNC_POSITION               equ 0004h
PSTR2CON_STR2SYNC_SIZE                   equ 0001h
PSTR2CON_STR2SYNC_LENGTH                 equ 0001h
PSTR2CON_STR2SYNC_MASK                   equ 0010h
PSTR2CON_P2DC02_POSN                     equ 0000h
PSTR2CON_P2DC02_POSITION                 equ 0000h
PSTR2CON_P2DC02_SIZE                     equ 0001h
PSTR2CON_P2DC02_LENGTH                   equ 0001h
PSTR2CON_P2DC02_MASK                     equ 0001h
PSTR2CON_P2DC12_POSN                     equ 0001h
PSTR2CON_P2DC12_POSITION                 equ 0001h
PSTR2CON_P2DC12_SIZE                     equ 0001h
PSTR2CON_P2DC12_LENGTH                   equ 0001h
PSTR2CON_P2DC12_MASK                     equ 0002h
PSTR2CON_P2DC22_POSN                     equ 0002h
PSTR2CON_P2DC22_POSITION                 equ 0002h
PSTR2CON_P2DC22_SIZE                     equ 0001h
PSTR2CON_P2DC22_LENGTH                   equ 0001h
PSTR2CON_P2DC22_MASK                     equ 0004h
PSTR2CON_P2DC32_POSN                     equ 0003h
PSTR2CON_P2DC32_POSITION                 equ 0003h
PSTR2CON_P2DC32_SIZE                     equ 0001h
PSTR2CON_P2DC32_LENGTH                   equ 0001h
PSTR2CON_P2DC32_MASK                     equ 0008h
PSTR2CON_P2DC42_POSN                     equ 0004h
PSTR2CON_P2DC42_POSITION                 equ 0004h
PSTR2CON_P2DC42_SIZE                     equ 0001h
PSTR2CON_P2DC42_LENGTH                   equ 0001h
PSTR2CON_P2DC42_MASK                     equ 0010h
PSTR2CON_P2DC0CON_POSN                   equ 0000h
PSTR2CON_P2DC0CON_POSITION               equ 0000h
PSTR2CON_P2DC0CON_SIZE                   equ 0001h
PSTR2CON_P2DC0CON_LENGTH                 equ 0001h
PSTR2CON_P2DC0CON_MASK                   equ 0001h
PSTR2CON_P2DC1CON_POSN                   equ 0001h
PSTR2CON_P2DC1CON_POSITION               equ 0001h
PSTR2CON_P2DC1CON_SIZE                   equ 0001h
PSTR2CON_P2DC1CON_LENGTH                 equ 0001h
PSTR2CON_P2DC1CON_MASK                   equ 0002h
PSTR2CON_P2DC2CON_POSN                   equ 0002h
PSTR2CON_P2DC2CON_POSITION               equ 0002h
PSTR2CON_P2DC2CON_SIZE                   equ 0001h
PSTR2CON_P2DC2CON_LENGTH                 equ 0001h
PSTR2CON_P2DC2CON_MASK                   equ 0004h
PSTR2CON_P2DC3CON_POSN                   equ 0003h
PSTR2CON_P2DC3CON_POSITION               equ 0003h
PSTR2CON_P2DC3CON_SIZE                   equ 0001h
PSTR2CON_P2DC3CON_LENGTH                 equ 0001h
PSTR2CON_P2DC3CON_MASK                   equ 0008h
PSTR2CON_P2DC4CON_POSN                   equ 0004h
PSTR2CON_P2DC4CON_POSITION               equ 0004h
PSTR2CON_P2DC4CON_SIZE                   equ 0001h
PSTR2CON_P2DC4CON_LENGTH                 equ 0001h
PSTR2CON_P2DC4CON_MASK                   equ 0010h
PSTR2CON_STRA2_POSN                      equ 0000h
PSTR2CON_STRA2_POSITION                  equ 0000h
PSTR2CON_STRA2_SIZE                      equ 0001h
PSTR2CON_STRA2_LENGTH                    equ 0001h
PSTR2CON_STRA2_MASK                      equ 0001h
PSTR2CON_STRB2_POSN                      equ 0001h
PSTR2CON_STRB2_POSITION                  equ 0001h
PSTR2CON_STRB2_SIZE                      equ 0001h
PSTR2CON_STRB2_LENGTH                    equ 0001h
PSTR2CON_STRB2_MASK                      equ 0002h
PSTR2CON_STRC2_POSN                      equ 0002h
PSTR2CON_STRC2_POSITION                  equ 0002h
PSTR2CON_STRC2_SIZE                      equ 0001h
PSTR2CON_STRC2_LENGTH                    equ 0001h
PSTR2CON_STRC2_MASK                      equ 0004h
PSTR2CON_STRD2_POSN                      equ 0003h
PSTR2CON_STRD2_POSITION                  equ 0003h
PSTR2CON_STRD2_SIZE                      equ 0001h
PSTR2CON_STRD2_LENGTH                    equ 0001h
PSTR2CON_STRD2_MASK                      equ 0008h
PSTR2CON_STRSYNC2_POSN                   equ 0004h
PSTR2CON_STRSYNC2_POSITION               equ 0004h
PSTR2CON_STRSYNC2_SIZE                   equ 0001h
PSTR2CON_STRSYNC2_LENGTH                 equ 0001h
PSTR2CON_STRSYNC2_MASK                   equ 0010h

// Register: ECCP2AS
#define ECCP2AS ECCP2AS
ECCP2AS                                  equ 0F64h
// bitfield definitions
ECCP2AS_P2SSBD_POSN                      equ 0000h
ECCP2AS_P2SSBD_POSITION                  equ 0000h
ECCP2AS_P2SSBD_SIZE                      equ 0002h
ECCP2AS_P2SSBD_LENGTH                    equ 0002h
ECCP2AS_P2SSBD_MASK                      equ 0003h
ECCP2AS_P2SSAC_POSN                      equ 0002h
ECCP2AS_P2SSAC_POSITION                  equ 0002h
ECCP2AS_P2SSAC_SIZE                      equ 0002h
ECCP2AS_P2SSAC_LENGTH                    equ 0002h
ECCP2AS_P2SSAC_MASK                      equ 000Ch
ECCP2AS_CCP2AS_POSN                      equ 0004h
ECCP2AS_CCP2AS_POSITION                  equ 0004h
ECCP2AS_CCP2AS_SIZE                      equ 0003h
ECCP2AS_CCP2AS_LENGTH                    equ 0003h
ECCP2AS_CCP2AS_MASK                      equ 0070h
ECCP2AS_CCP2ASE_POSN                     equ 0007h
ECCP2AS_CCP2ASE_POSITION                 equ 0007h
ECCP2AS_CCP2ASE_SIZE                     equ 0001h
ECCP2AS_CCP2ASE_LENGTH                   equ 0001h
ECCP2AS_CCP2ASE_MASK                     equ 0080h
ECCP2AS_P2SSBD0_POSN                     equ 0000h
ECCP2AS_P2SSBD0_POSITION                 equ 0000h
ECCP2AS_P2SSBD0_SIZE                     equ 0001h
ECCP2AS_P2SSBD0_LENGTH                   equ 0001h
ECCP2AS_P2SSBD0_MASK                     equ 0001h
ECCP2AS_P2SSBD1_POSN                     equ 0001h
ECCP2AS_P2SSBD1_POSITION                 equ 0001h
ECCP2AS_P2SSBD1_SIZE                     equ 0001h
ECCP2AS_P2SSBD1_LENGTH                   equ 0001h
ECCP2AS_P2SSBD1_MASK                     equ 0002h
ECCP2AS_P2SSAC0_POSN                     equ 0002h
ECCP2AS_P2SSAC0_POSITION                 equ 0002h
ECCP2AS_P2SSAC0_SIZE                     equ 0001h
ECCP2AS_P2SSAC0_LENGTH                   equ 0001h
ECCP2AS_P2SSAC0_MASK                     equ 0004h
ECCP2AS_P2SSAC1_POSN                     equ 0003h
ECCP2AS_P2SSAC1_POSITION                 equ 0003h
ECCP2AS_P2SSAC1_SIZE                     equ 0001h
ECCP2AS_P2SSAC1_LENGTH                   equ 0001h
ECCP2AS_P2SSAC1_MASK                     equ 0008h
ECCP2AS_CCP2AS0_POSN                     equ 0004h
ECCP2AS_CCP2AS0_POSITION                 equ 0004h
ECCP2AS_CCP2AS0_SIZE                     equ 0001h
ECCP2AS_CCP2AS0_LENGTH                   equ 0001h
ECCP2AS_CCP2AS0_MASK                     equ 0010h
ECCP2AS_CCP2AS1_POSN                     equ 0005h
ECCP2AS_CCP2AS1_POSITION                 equ 0005h
ECCP2AS_CCP2AS1_SIZE                     equ 0001h
ECCP2AS_CCP2AS1_LENGTH                   equ 0001h
ECCP2AS_CCP2AS1_MASK                     equ 0020h
ECCP2AS_CCP2AS2_POSN                     equ 0006h
ECCP2AS_CCP2AS2_POSITION                 equ 0006h
ECCP2AS_CCP2AS2_SIZE                     equ 0001h
ECCP2AS_CCP2AS2_LENGTH                   equ 0001h
ECCP2AS_CCP2AS2_MASK                     equ 0040h
ECCP2AS_PSS2BD_POSN                      equ 0000h
ECCP2AS_PSS2BD_POSITION                  equ 0000h
ECCP2AS_PSS2BD_SIZE                      equ 0002h
ECCP2AS_PSS2BD_LENGTH                    equ 0002h
ECCP2AS_PSS2BD_MASK                      equ 0003h
ECCP2AS_PSS2AC_POSN                      equ 0002h
ECCP2AS_PSS2AC_POSITION                  equ 0002h
ECCP2AS_PSS2AC_SIZE                      equ 0002h
ECCP2AS_PSS2AC_LENGTH                    equ 0002h
ECCP2AS_PSS2AC_MASK                      equ 000Ch
ECCP2AS_PSS2BD0_POSN                     equ 0000h
ECCP2AS_PSS2BD0_POSITION                 equ 0000h
ECCP2AS_PSS2BD0_SIZE                     equ 0001h
ECCP2AS_PSS2BD0_LENGTH                   equ 0001h
ECCP2AS_PSS2BD0_MASK                     equ 0001h
ECCP2AS_PSS2BD1_POSN                     equ 0001h
ECCP2AS_PSS2BD1_POSITION                 equ 0001h
ECCP2AS_PSS2BD1_SIZE                     equ 0001h
ECCP2AS_PSS2BD1_LENGTH                   equ 0001h
ECCP2AS_PSS2BD1_MASK                     equ 0002h
ECCP2AS_PSS2AC0_POSN                     equ 0002h
ECCP2AS_PSS2AC0_POSITION                 equ 0002h
ECCP2AS_PSS2AC0_SIZE                     equ 0001h
ECCP2AS_PSS2AC0_LENGTH                   equ 0001h
ECCP2AS_PSS2AC0_MASK                     equ 0004h
ECCP2AS_PSS2AC1_POSN                     equ 0003h
ECCP2AS_PSS2AC1_POSITION                 equ 0003h
ECCP2AS_PSS2AC1_SIZE                     equ 0001h
ECCP2AS_PSS2AC1_LENGTH                   equ 0001h
ECCP2AS_PSS2AC1_MASK                     equ 0008h

